Конспекты25/src/Catalogs/Заметки/Заметки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Заметки</name>
  <attributes>
    <name>Тема</name>
    <type>
      <types>CatalogRef.Темы</types>
    </type>
  </attributes>
  <attributes>
    <name>Лекция</name>
    <type>
      <types>CatalogRef.Лекции</types>
    </type>
  </attributes>
  <attributes>
    <name>ОсновнойТекст</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Поля</name>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Тэг</name>
      <type>
        <types>CatalogRef.Тэги</types>
      </type>
    </attributes>
    <attributes>
      <name>Картинка</name>
      <type>
        <types>CatalogRef.ЗаметкиФайлы</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конспекты25/src/Catalogs/Заметки/Forms/ФормаЭлемента/Module.bsl
#Область ОписаниеПеременных

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если ПолучитьКоличествоСтрокПолей() = 0 Тогда
 		ДобавитьНачальнуюСтраницуHTML();	
	КонецЕсли;
	
	Объект.ОсновнойТекст = СформироватьОсновнойТекст();
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаВыбора(ВыбранноеЗначение, ИсточникВыбора)	
	
	НомерСтроки = ПолучитьНомерСтрокиДляВставки();
	
	Структура = Новый Структура;
 	Структура.Вставить("ТекстДобавления", ВыбранноеЗначение.ВведенныйТекст);
 	Структура.Вставить("НомерСтроки"	, НомерСтроки-1);
 	Структура.Вставить("Вставка"		, Истина);
 	
 	ДобавитьСтрокуHTML(Структура); 
	
	Объект.ОсновнойТекст 	= СформироватьОсновнойТекст();	
	
	Модифицированность 		= Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура КомандаВвестиТекст(Команда)
	СтрутураПараметров = Новый Структура;	
	
//	ТекСтрока = Элементы.Поля.ТекущиеДанные;
//		
//	Если ТекСтрока = Неопределено Тогда
//		НомерСтроки = ПолучитьКоличествоСтрокКомментариев()-1;
//	Иначе	
//		НомерСтроки = текСтрока.НомерСтроки;
//	КонецЕсли;
	
	//СтрутураПараметров.Вставить("НомерСтроки",	НомерСтроки);
	//СтрутураПараметров.Вставить("Вставка",		Истина);
	
	ОткрытьФорму("Справочник.Заметки.Форма.ФормаРедактирования", СтрутураПараметров, ЭтотОбъект);
КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьНомерСтрокиДляВставки()
	
	Отбор = Новый Структура();
	Отбор.Вставить("Значение", "</body>");
	 
	ПоискБоди = Объект.Поля.НайтиСтроки(Отбор);
	
	Если ПоискБоди = Неопределено Тогда
		НомерСтроки = ПолучитьКоличествоСтрокПолей();
	Иначе
		НомерСтроки = ПоискБоди[0].НомерСтроки	
	КонецЕсли;			
	
	Возврат НомерСтроки;
	
КонецФункции

&НаСервере
Функция ПолучитьКоличествоСтрокПолей()
	Возврат Объект.Поля.Количество();
КонецФункции

 &НаСервере
 Процедура ДобавитьНачальнуюСтраницуHTML()
 	Структура = Новый Структура;
 	
 	Структура.Вставить("Вставка", Ложь);
 	
 	Структура.Вставить("ТекстДобавления", "<!DOCTYPE html>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<html lang=""ru"">");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	ТекстДобавления = ДобавитьHead();
 		
 	Структура.Вставить("ТекстДобавления", ТекстДобавления);
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "<body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</body>");
 	ДобавитьСтрокуHTML(Структура); 
 	
 	Структура.Вставить("ТекстДобавления", "</html>");
 	ДобавитьСтрокуHTML(Структура); 
 
 КонецПроцедуры
 
  &НаСервере
 Функция ДобавитьHead()
 	ТекстКоментария = "";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "<head>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<meta charset=""UTF-8""" + ">";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "	<title>" + Объект.Наименование + "</title>";
 	ТекстКоментария = ТекстКоментария + Символы.ПС + "</head>";
 	
 	Возврат ТекстКоментария; 
 КонецФункции
 
  &НаСервере
 Процедура ДобавитьСтрокуHTML(Структура)
 	Если Структура.Вставка Тогда
 		НоваяСтрока = Объект.Поля.Вставить(Структура.НомерСтроки)
 	Иначе	
 		НоваяСтрока = Объект.Поля.Добавить();	
 	КонецЕсли;
 	
 	НоваяСтрока.Значение = Структура.ТекстДобавления; 
 КонецПроцедуры
 
  &НаСервере
Функция СформироватьОсновнойТекст()
	ОсновнойТекст = "";
	
	Для Каждого СтрокаТЧ Из Объект.Поля Цикл
		Если ЗначениеЗаполнено(СтрокаТЧ.Тэг) Тогда
			ТекстДляВставки = "";
			Если СтрокаТЧ.Тэг.Одиночный Тогда			
				ТекстДляВставки = ПолучитьТекстДляВставки_Одиночный(СтрокаТЧ);
			Иначе
				ТекстДляВставки = ПолучитьТекстДляВставки_Двойной(СтрокаТЧ);
			КонецЕсли;
			ОсновнойТекст = ОсновнойТекст + ТекстДляВставки;
		Иначе //Без тегов
			ОсновнойТекст = ОсновнойТекст + СтрокаТЧ.Значение;
		КонецЕсли;
	КонецЦикла;
	
	Возврат ОсновнойТекст;
	
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Одиночный(СтрокаТЧ)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Картинка) Тогда	
//		Если ЭтоКартинка(СтрокаТЧ.Картинка.Расширение) Тогда			
//			ТекстДляВставки = ПолучитьТекстДляВставки_Картинки(СтрокаТЧ);
//		Иначе
//			ТекстДляВставки = "<p><a href=""path/to/file"">" + СтрокаТЧ.Картинка.Наименование + " (файл " + СтрокаТЧ.НомерСтроки + ")</a></p>"; //- файл
//		КонецЕсли;
//	Иначе
		ТекстДляВставки = "<" + СтрокаТЧ.Тэг.Наименование + " >" + СтрокаТЧ.Значение; //не картинка 
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки_Двойной(СтрокаТЧ)
//	Если ЗначениеЗаполнено(СтрокаТЧ.Якорь) Тогда
//		ТекстДляВставки = ПолучитьТекстдляВставки_Якорь(СтрокаТЧ);	
//	Иначе
		ТекстДляВставки = ПолучитьТекстДляВставки(СтрокаТЧ);
	//КонецЕсли;
	
	Возврат ТекстДляВставки;
КонецФункции

&НаСервере
Функция ПолучитьТекстДляВставки(СтрокаТЧ)
	ТекстДляВставки = "";
	
	ТекстВставки = СтрЗаменить(СтрокаТЧ.Значение,Символы.ПС ,"<br>");
	ТекстДляВставки =  
		"<" + СтрокаТЧ.Тэг.Наименование 
		+ " style = 'margin-left: 40px';>"
		+ ТекстВставки 
		+ "</" 
		+ СтрокаТЧ.Тэг.Наименование 
		+ ">";
	
	Возврат ТекстДляВставки
	
КонецФункции

#КонецОбласти
